package com.academy.homework.tasks.cycles;

public class Task1 {
  /*1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.*/

  public static void main(String[] args) {

    for (int i = 10; i < 21; i++) {
      System.out.println(Math.pow(i,2));
    }

  }
}
